{
  "nextQuest": "GatherFirewood",
  "nextDialogue": "FinishedGatherWood",
  "requiredQuestForNextDialogue": "GatherFirewood",
	"mainDialogue": [
		{
			"speaker": "Jack",
			"speech": "H-hey! You’re from the ship, right? Obviously.."
		},
		{
			"speaker": "Jack",
			"speech": "Where is everybody else? Are they OK? Are you OK? God, what are we going to do..."
		},
		{
			"speaker": "???",
			"speech": "...Calm down, kid."
		},
		{
			"speaker": "???",
			"speech": "I’ll tell you what I can but first, what’s your name?"
		},
		{
			"speaker": "Jack",
			"speech": "Okay… My name’s Jack."
		},
		{
			"speaker": "John",
			"speech": "Well mine’s John, how old are ya?"
		},
		{
			"speaker": "Jack",
			"speech": "I’m 21."
		},
		{
			"speaker": "John",
			"speech": "You do seem younger than most... Can you walk kid? We’re gonna have to get movin’ soon."
		},	
		{
			"speaker": "Jack",
			"speech": "Yea sure thing, all I got is my rifle to carry anyways..."
		},
		{
			"speaker": "John",
			"speech": "Well be prepared to carry a heck of a lot more, we’re gonna set up shelter for the night. I’m gonna need you to gather wood for me..."
		},
		{
			"speaker": "Jack",
			"speech": "Why do we need to make shelter now? Shouldn’t we look for others?"
		},
		{
			"speaker": "John",
			"speech": "We will, kid... Listen, I don’t know how long you’ve been out but we’ve been here for one night already, no clue how you’ve been restin’ easy till now… Aren’t you hungry?"
		},
		{
			"speaker": "Jack",
			"speech": "Now that you mention it, I’m starving… Have I really been out that long?"
		},
		{
			"speaker": "John",
			"speech": "Seems like it... I was actually with a group last night. I was tasked with watching the shore in case more of us wash up…"
		},
		{
			"speaker": "John",
			"speech": "By the time I had come back to check in with em’ this morning they were all gone… Not sure why or when they had moved but regardless, they couldn’t have made it far."
		},
		{
			"speaker": "Jack",
			"speech": "Wait, they just disappeared? What could have happened?"
		},
		{
			"speaker": "John",
			"speech": "Like I said, I don’t know. They wouldn’t have abandoned me for just no reason though…"
		},
		{
			"speaker": "Jack",
			"speech": "Alright… So is there anything else we know? Where are we?"
		},
		{
			"speaker": "John",
			"speech": "No idea... Don’t know where we are or how the ship went down when it did. Just be sure to listen to me and we’ll work out fine, only a matter of time before someone finds us"
		},
		{
			"speaker": "Jack",
			"speech": "Alright John… So we need wood right?"
		},
		{
			"speaker": "John",
			"speech": "That’s right, bring me back 8 pieces of wood and meet me back here. Once we have a fire and some shelter over our heads, we’ll think about food."
		}
	],
  "idleDialogue": [
		{
			"speaker": "John",
			"speech": "Well, what are you waiting for? Just walk around and bring back some wood logs."
		}
  ]
}